// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// По умолчанию.
// 
// Возвращаемое значение:
//  СправочникСсылка.СервераYellowCollector - 
Функция ПоУмолчанию() Экспорт
	Возврат Основной;
КонецФункции

Функция Активный() Экспорт
	
	Запрос = Новый Запрос(ТекстЗапросаАктивный());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сервер;
	КонецЕсли;
	
	Возврат ПоУмолчанию();
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаАктивный() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СервераYellowCollector.Ссылка КАК Сервер
	|ИЗ
	|	Справочник.СервераYellowCollector КАК СервераYellowCollector
	|ГДЕ
	|	СервераYellowCollector.Активный";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
