#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ТексHTMLИндекснойСтраницы(РежимОтображения = "code") Экспорт 
	
	ИндекснаяСтраницаШаблон = ИндекснаяСтраницаШаблон(); 
	ИндекснаяСтраницаЗаменаТелаСкрипта = СтрЗаменить(ИндекснаяСтраницаШаблон, 
	                                                 "//jsoneditor_min_js", 
	                                                 ОсновнойСкриптШаблон()); 
	ИндекснаяСтраница = СтрЗаменить(ИндекснаяСтраницаЗаменаТелаСкрипта, 
	                                "//jsoneditor_min_css", 
	                                ОсновнойСкриптШаблон());

	ИндекснаяСтраница = СтрЗаменить(ИндекснаяСтраница, "//viewMode", РежимОтображения);
	
	Возврат ИндекснаяСтраница;
	
КонецФункции

#КонецОбласти   

#Область СлужебныеПроцедурыиФункции

Функция ИндекснаяСтраницаШаблон()
	Возврат ПолучитьМакет("ИндекснаяСтраница").ПолучитьТекст();	
КонецФункции 

Функция ТаблицаСтилейШаблон()
	Возврат ПолучитьМакет("ИндекснаяСтраница").ПолучитьТекст();	
КонецФункции

Функция ОсновнойСкриптШаблон()
	Возврат ПолучитьМакет("ОсновнойСкрипт").ПолучитьТекст();	
КонецФункции

#КонецОбласти


#КонецЕсли
	