// @strict-types

#Область ПрограммныйИнтерфейс

// Соответствие имен для запроса заголовки всех отчетов об ошибках.
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие -Соответствие имен для запроса заголовки всех отчетов об ошибках
Функция СоответствиеИменДляЗапросаЗаголовкиВсехОтчетовОбОшибках() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("id", ОписаниеДляСоотвествия("ИД", "ИД", "Строка"));
	Результат.Вставить("time", ОписаниеДляСоотвествия("Дата", "Дата", "Дата"));
	Результат.Вставить("clientInfoPlatformType", ОписаниеДляСоотвествия("ТипПлатформы", "Тип платформы","Строка"));
	Результат.Вставить("clientInfoAppVersion", ОписаниеДляСоотвествия("Версия", "Версия 1С", "Строка"));
	Результат.Вставить("sessionInfoUserName", ОписаниеДляСоотвествия("ИмяПользователя", "Пользователь", "Строка"));
	Результат.Вставить("configInfoName", ОписаниеДляСоотвествия("Конфигурация", "Конфигурация", "Строка"));
	Результат.Вставить("clientInfoAppName", ОписаниеДляСоотвествия("Приложение", "Приложение", "Строка"));
	Результат.Вставить("configInfoDescription", ОписаниеДляСоотвествия("ОписаниеКонфигурации", "Описание конфигурации", "Строка"));
	Результат.Вставить("lastLineOfTheErrorContext", ОписаниеДляСоотвествия("ПоследняяСтрокаСтекаВызововОшибки", "Последняя строка стека вызовов ошибки", "Строка"));
	Результат.Вставить("userDescription", ОписаниеДляСоотвествия("ПользовательскоеОписание", "Пользовательское описание", "Строка"));
	Результат.Вставить("configInfoDescription", ОписаниеДляСоотвествия("ОписаниеКонфигурации", "Описание конфигурации", "Строка"));
	Результат.Вставить("baseName", ОписаниеДляСоотвествия("База", "База", "Строка"));
	Результат.Вставить("group", ОписаниеДляСоотвествия("Группа", "Группа", "Строка"));
	Результат.Вставить("serverStackHash", ОписаниеДляСоотвествия("СерверХэшСтека", "Хэш стэка (сервер)", "Строка"));
	Результат.Вставить("clientStackHash", ОписаниеДляСоотвествия("КлиентХэшСтэка", "Хэш стэка (клиент)", "Строка"));
	
	Возврат ОбщегоНазначения.ФиксированныеДанные(Результат);
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Описание для соотвествия.
// 
// Параметры:
//  Имя - Строка - Имя
//  Заголовок - Строка - Заголовок
//  Тип -  Строка - Тип
// 
// Возвращаемое значение:
//  Структура - Описание для соотвествия:
// * Имя - Строка -
// * Заголовок - Строка -
// * Тип - Строка -
Функция ОписаниеДляСоотвествия(Имя, Заголовок, Тип)
	Возврат Новый Структура("Имя, Заголовок, Тип", Имя, Заголовок, Тип);
КонецФункции

#КонецОбласти

