// @strict-types

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Обработка.МониторОшибок.Форма.ВсеОшибки", 
	             ПараметрыФормы, 
	             ПараметрыВыполненияКоманды.Источник, 
	             ПараметрыВыполненияКоманды.Уникальность, 
	             ПараметрыВыполненияКоманды.Окно, 
	             ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
