#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ВзаимодействиеСYellowCollector

// Получить данные для основной таблицы ошибок.
// 
// Возвращаемое значение:
//  Соответствие, Структура - Получить данные для основной таблицы ошибок
Функция ПолучитьЗаголовкиВсехОтчетовОбОшибках(Знач ПараметрыЗапроса = Неопределено) Экспорт 
	Возврат YellowCollectorЗапросы.ПолучитьЗаголовкиВсехОтчетовОбОшибкахПоПараметрам(ПараметрыЗапроса);
КонецФункции

Функция ПолучитьДетальнуюИнформациюОтчетаОбОшибке(ИД) Экспорт
	Возврат YellowCollectorЗапросы.ПолучитьДеталиОтчетаОбОшибкеПоИД(ИД);
КонецФункции

Функция ПолучитьМаппингПолейЗапросаПолученияСпискаОшибок() Экспорт
	Возврат YellowCollectorЗапросы.ПолучитьМаппингПолейЗапросаПолученияСпискаОшибок();
КонецФункции

Функция ПолучитьМаппингПолейЗапросаОбщаяСтатистика() Экспорт
	Возврат YellowCollectorЗапросы.ПолучитьМаппингПолейЗапросаОбщаяСтатистика();
КонецФункции

Функция ПометитьНаУдалениеЗаголовокОтчетаПоИД(ИД) Экспорт
	Возврат YellowCollectorЗапросы.ПометитьНаУдалениеЗаголовокОтчетаПоИД(ИД);
КонецФункции

Функция СтатистикаПоОшибкамОбщая(Знач ПараметрыЗапроса = Неопределено) Экспорт
	Возврат YellowCollectorЗапросы.СтатистикаПоОшибкамОбщая(ПараметрыЗапроса);
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли