#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ВзаимодействиеСYellowCollector

// Получить данные для основной таблицы ошибок.
// 
// Возвращаемое значение:
//  Соответствие, Структура - Получить данные для основной таблицы ошибок
Функция ПолучитьЗаголовкиВсехОтчетовОбОшибках() Экспорт 
	Возврат YellowCollectorЗапросы.ПолучитьЗаголовкиВсехОтчетовОбОшибкахПоПараметрам();
КонецФункции

Функция ПолучитьДетальнуюИнформациюОтчетаОбОшибке(ИД) Экспорт
	Возврат YellowCollectorЗапросы.ПолучитьДеталиОтчетаОбОшибкеПоИД(ИД);
КонецФункции

Функция ПолучитьМаппингПолейЗапросаПолученияСпискаОшибок() Экспорт
	Возврат YellowCollectorЗапросы.ПолучитьМаппингПолейЗапросаПолученияСпискаОшибок();
КонецФункции
	
#КонецОбласти

#КонецОбласти

#КонецЕсли